<?php
// php artisan db:seed --class=CitySeeder
namespace Database\Seeders;

use App\Models\Geo\City;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [
            'تهران',
            'مشهد',
            'اصفهان',
            'کرج',
            'شیراز',
            'تبریز',
            'قم',
            'اهواز',
            'کرمانشاه',
            'ارومیه',
            'رشت',
            'زاهدان',
            'همدان',
            'کرمان',
            'یزد',
            'اردبیل',
            'بندرعباس',
            'اراک',
            'اسلامشهر',
            'زنجان',
            'سنندج',
            'قزوین',
            'خرم‌آباد',
            'گرگان',
            'ساری',
            'ملارد',
            'بابل',
            'نیشابور',
            'سبزوار',
            'آمل',
            'بجنورد',
            'بوشهر',
            'شهرکرد',
            'ایلام',
            'یاسوج',
            'سمنان',
            'قائم‌شهر',
            'گرمسار',
            'شاهرود',
            'کاشان',
            'نجف‌آباد',
            'خوی',
            'بروجرد',
            'سیرجان',
            'رفسنجان',
            'دزفول',
            'مرودشت',
            'جهرم',
            'کازرون',
            'فسا',
            'بیرجند',
            'گناباد',
            'تربت جام',
            'تربت حیدریه',
            'لار',
            'لامرد',
            'میناب',
            'رودبار',
            'رامسر',
            'نوشهر',
            'چالوس',
            'تنکابن',
            'آستارا',
            'پارس‌آباد',
            'مشگین‌شهر',
            'خلخال',
            'گرماب',
            'بیجار',
            'سقز',
            'مریوان',
            'بانه',
            'پاوه',
            'کنگاور',
            'نهاوند',
            'تویسرکان',
            'ملایر',
            'اسدآباد',
            'رزن',
            'فامنین',
        ];

        foreach ($cities as $city) {
            City::create(['name' => $city, 'status' => 1]);
        }
    }
}
